app/graphql/mutations/user_mutations/user_update.rb

    def resolve(id: nil, email: nil, user_role: nil, name: nil, surname: nil, contacts: [])
      user = User.find(id)

      return permission_error unless (context[:ability].can? :update, User) || (Abilities::ManageUserAbility.new(context[:current_user], user).can? :update, User)

      user.update!(
        email: email || user.email,
        user_role: user_role || user.user_role,
        name: name || user.name,
        surname: surname || user.surname
      )

      user.contacts.destroy_all

      contacts.each do |contact|
        Companion.find_or_create_by(user_id: id, contact_id: contact).save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
UPDATE `users` SET `users`.`surname` = 'newSurname', `users`.`updated_at` = '2020-11-11 07:58:46.937744' WHERE `users`.`id` = 3
INSERT INTO `companions` (`user_id`, `contact_id`, `created_at`, `updated_at`) VALUES (7, 2, '2020-11-11 21:12:36.357679', '2020-11-11 21:12:36.357679')
SELECT `companions`.* FROM `companions` WHERE `companions`.`user_id` = 7 AND `companions`.`contact_id` = 2 LIMIT 1