app/graphql/mutations/user_mutations/user_create.rb

INSERT INTO `users` (`email`, `user_role`, `created_at`, `updated_at`) VALUES ('d@d.d', 'operator', '2020-11-11 17:17:03.234228', '2020-11-11 17:17:03.234228')
INSERT INTO `companions` (`user_id`, `contact_id`, `created_at`, `updated_at`) VALUES (7, 1, '2020-11-11 17:19:23.235698', '2020-11-11 17:19:23.235698')
SELECT `companions`.* FROM `companions` WHERE `companions`.`user_id` = 7 AND `companions`.`contact_id` = 1 LIMIT 1
---
    def resolve(email: nil, user_role: nil, name: nil, surname: nil, contacts: [])
      return permission_error unless context[:ability].can? :create, User

      user = User.create!(email: email, name: name, surname: surname, user_role: user_role)

      contacts.each do |contact|
        Companion.find_or_create_by(user_id: user.id, contact_id: contact).save