app/graphql/mutations/user_mutations/user_destroy.rb

    def resolve(id: nil)
      return permission_error unless context[:ability].can? :destroy, User

      user = User.find(id)

      user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 4