app/graphql/mutations/contract_mutations/contract_create.rb

    def resolve(client_id: nil, insurance_id: nil, user_id:nil)
      return permission_error unless context[:ability].can? :create, Contract

      Contract.create!(
        client_id: client_id,
        user_id: user_id || context[:current_user].id,
        insurance_id: insurance_id
      )
---
INSERT INTO `contracts` (`client_id`, `user_id`, `insurance_id`, `created_at`, `updated_at`) VALUES (2, 1, 2, '2020-11-11 20:07:44.895418', '2020-11-11 20:07:44.895418')