app/graphql/mutations/contract_mutations/contract_destroy.rb

SELECT `contracts`.* FROM `contracts` WHERE `contracts`.`id` = 1 LIMIT 1
DELETE FROM `contracts` WHERE `contracts`.`id` = 2
---
    def resolve(id: nil)
      return permission_error unless context[:ability].can? :destroy, Contract

      contract = Contract.find(id)

      contract.destroy