app/graphql/mutations/insurance_mutations/insurance_destroy.rb

SELECT `insurances`.* FROM `insurances` WHERE `insurances`.`id` = 1 LIMIT 1
DELETE FROM `insurances` WHERE `insurances`.`id` = 1
---
    def resolve(id: nil)
      return permission_error unless context[:ability].can? :destroy, Insurance

      insurance = Insurance.find(id)

      insurance.destroy