app/graphql/mutations/insurance_mutations/insurance_create.rb

INSERT INTO `insurances` (`name`, `agency_name`, `insurance_type`, `total_cost`, `period`, `created_at`, `updated_at`) VALUES ('base', 'agency', 'life', 150.0, 'monthly', '2020-11-11 18:51:46.311883', '2020-11-11 18:51:46.311883')
---
    def resolve(**args)
      return permission_error unless context[:ability].can? :create, Insurance

      Insurance.create!(args)