app/graphql/mutations/insurance_mutations/insurance_update.rb

    def resolve(id: nil, name: nil, agency_name: nil, insurance_type: nil, total_cost: nil, period: nil)
      return permission_error unless context[:ability].can? :update, Insurance

      insurance = Insurance.find(id)

      insurance.update!(
        agency_name: agency_name || insurance.agency_name,
        name: name || insurance.name,
        insurance_type: insurance_type || insurance.insurance_type,
        total_cost: total_cost || insurance.total_cost,
        period: period || insurance.period
      )
---
SELECT `insurances`.* FROM `insurances` WHERE `insurances`.`id` = 1 LIMIT 1
UPDATE `insurances` SET `insurances`.`name` = 'base', `insurances`.`updated_at` = '2020-11-11 18:50:22.403067' WHERE `insurances`.`id` = 1