app/graphql/mutations/client_mutations/client_create.rb

    def resolve(**args)
      return permission_error unless context[:ability].can? :create, Client

      Client.create!(args)
---
INSERT INTO `clients` (`name`, `email`, `created_at`, `updated_at`) VALUES ('qwe', 'client1@a.a', '2020-11-11 17:39:52.002984', '2020-11-11 17:39:52.002984')