app/graphql/mutations/client_mutations/client_destroy.rb

SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
DELETE FROM `clients` WHERE `clients`.`id` = 1
---
    def resolve(id: nil)
      return permission_error unless context[:ability].can? :destroy, Client

      client = Client.find(id)

      client.destroy