app/graphql/mutations/client_mutations/client_update.rb

    def resolve(id: nil, email: nil, name: nil, surname: nil)
      return permission_error unless context[:ability].can? :update, Client

      client = Client.find(id)

      client.update!(
        email: email || client.email,
        name: name || client.name,
        surname: surname || client.surname
      )
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 2 LIMIT 1
UPDATE `clients` SET `clients`.`surname` = 'sure', `clients`.`updated_at` = '2020-11-11 17:52:34.306730' WHERE `clients`.`id` = 2