app/graphql/types/query_type.rb

    def user(params)
      user =  User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

    def compare(params)
      return permission_error unless context[:ability].can? :compare, Insurance

      minimal_price = Float::MAX
      lower_price_insurance = nil

      params[:list].each do |id|
        insurance = Insurance.find(id)
---
SELECT `insurances`.* FROM `insurances` WHERE `insurances`.`id` = 2 LIMIT 1