app/controllers/application_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 AND `users`.`user_role` = 'operator' ORDER BY `users`.`id` ASC LIMIT 1
---
  def fetch_user
    id = request.headers['AUTHENTICATED-USERID']
    user_role = request.headers['AUTHENTICATED-SCOPE']
    @user = User.where(id: id, user_role: user_role).first