app/models/abilities/manage_user_ability.rb

SELECT 1 AS one FROM `users` INNER JOIN `companions` ON `users`.`id` = `companions`.`contact_id` WHERE `companions`.`user_id` = 2 AND `users`.`id` = 1 LIMIT 1
---
  def initialize(user, target)
    if user.id == target.id
      can :update, User
    elsif target.user_role == 'operator' && user.contacts.include?(target)